[Killed] StringLiteral
main/components/DokkuScripts/DokkuScriptForm.jsx:100:33
                     isInvalid={Boolean(errors.org)}
                     defaultValue={params.org || ""}
                     {...register("org", {
-                      required: "org is required.",
+                      required: "",
                     })}
                   />
killedBy: DokkuScript tests when form is submitted without filling in required fields
statusReason: Unable to find an element with the text: /org is required/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="py-5 DokkuScriptForm container"
      data-testid="DokkuScriptForm"

[Killed] LogicalOperator
main/components/DokkuScripts/DokkuScriptForm.jsx:127:35
                     data-testid={`${testId}-repo`}
                     type="text"
                     isInvalid={Boolean(errors.repo)}
-                    defaultValue={params.repo || ""}
+                    defaultValue={params.repo && ""}
                     {...register("repo", {
                       required: "repo is required.",
killedBy: HomePage tests uses values from local storage when set
statusReason: expected "spy" to be called with arguments: [ 'HomePage.params', …(1) ]

Number of calls: 0

[Killed] StringLiteral
main/components/DokkuScripts/DokkuScriptForm.jsx:129:33
                     isInvalid={Boolean(errors.repo)}
                     defaultValue={params.repo || ""}
                     {...register("repo", {
-                      required: "repo is required.",
+                      required: "",
                     })}
                   />
killedBy: DokkuScript tests when form is submitted without filling in required fields
statusReason: Unable to find an element with the text: /repo is required/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="py-5 DokkuScriptForm container"
      data-testid="DokkuScriptForm"

[Killed] StringLiteral
main/components/DokkuScripts/DokkuScriptForm.jsx:139:34
                 <Col sm={4}>
                   <Form.Text
                     className="text-muted"
-                    data-testid={`${testId}-repo-help`}
+                    data-testid={``}
                   >
                     The name of your repository, e.g. <code>team01</code>,{" "}
killedBy: DokkuScript tests has expected help content
statusReason: Unable to find an element by: [data-testid="DokkuScriptForm-repo-help"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="py-5 DokkuScriptForm container"
      data-testid="DokkuScriptForm"

[Killed] ObjectLiteral
main/components/DokkuScripts/DokkuScriptForm.jsx:161:54
                     type="text"
                     isInvalid={Boolean(errors.google_client_id)}
                     defaultValue={params.google_client_id || ""}
-                    {...register("google_client_id", {
-                      required: "Google Client ID is required.",
-                    })}
+                    {...register("google_client_id", {})}
                   />
                   <Form.Control.Feedback type="invalid">
killedBy: DokkuScript tests when form is submitted without filling in required fields
statusReason: Unable to find an element with the text: /Google Client Id is required/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="py-5 DokkuScriptForm container"
      data-testid="DokkuScriptForm"

[Killed] StringLiteral
main/components/DokkuScripts/DokkuScriptForm.jsx:195:33
                     isInvalid={Boolean(errors.google_client_secret)}
                     defaultValue={params.google_client_secret || ""}
                     {...register("google_client_secret", {
-                      required: "Google Client Secret is required.",
+                      required: "",
                     })}
                   />
killedBy: DokkuScript tests when form is submitted without filling in required fields
statusReason: Unable to find an element with the text: /Google Client Secret is required/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="py-5 DokkuScriptForm container"
      data-testid="DokkuScriptForm"
