[Killed] StringLiteral
main/components/DokkuScripts/DokkuScriptForm.jsx:16:18
     formState: { errors },
   } = useForm();
 
-  const testId = "DokkuScriptForm";
+  const testId = "";
   return (
     <Container className="py-5 DokkuScriptForm" data-testid={testId}>
killedBy: DokkuScript tests has expected attributes
statusReason: Unable to find an element by: [data-testid="DokkuScriptForm"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="py-5 DokkuScriptForm container"
      data-testid=""

[Killed] ConditionalExpression
main/components/DokkuScripts/DokkuScriptForm.jsx:37:35
                     data-testid={`${testId}-appname`}
                     type="text"
                     isInvalid={Boolean(errors.appname)}
-                    defaultValue={params.appname || ""}
+                    defaultValue={true}
                     {...register("appname", {
                       required: "appname is required.",
killedBy: DokkuScript tests when form is submitted
statusReason: expected "spy" to be called with arguments: [ { appname: 'team01', …(5) } ]

Received: 

  1st spy call:

@@ -1,8 +1,8 @@
  [

[Killed] ConditionalExpression
main/components/DokkuScripts/DokkuScriptForm.jsx:37:35
                     data-testid={`${testId}-appname`}
                     type="text"
                     isInvalid={Boolean(errors.appname)}
-                    defaultValue={params.appname || ""}
+                    defaultValue={false}
                     {...register("appname", {
                       required: "appname is required.",
killedBy: DokkuScript tests when form is submitted
statusReason: expected "spy" to be called with arguments: [ { appname: 'team01', …(5) } ]

Received: 

  1st spy call:

@@ -1,8 +1,8 @@
  [

[Killed] ObjectLiteral
main/components/DokkuScripts/DokkuScriptForm.jsx:38:45
                     type="text"
                     isInvalid={Boolean(errors.appname)}
                     defaultValue={params.appname || ""}
-                    {...register("appname", {
-                      required: "appname is required.",
-                    })}
+                    {...register("appname", {})}
                   />
                   <Form.Control.Feedback type="invalid">
killedBy: DokkuScript tests when form is submitted without filling in required fields
statusReason: Unable to find an element with the text: /appname is required/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="py-5 DokkuScriptForm container"
      data-testid="DokkuScriptForm"

[Killed] StringLiteral
main/components/DokkuScripts/DokkuScriptForm.jsx:51:75
                     className="text-muted"
                     data-testid={`${testId}-appname-help`}
                   >
-                    The name of your Dokku app, e.g. <code>team01</code>,{" "}
+                    The name of your Dokku app, e.g. <code>team01</code>,{""}
                     <code>team01-qa</code>, <code>courses-dev-cgaucho</code>,
                     etc.
killedBy: DokkuScript tests has expected help content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  The name of your Dokku app, e.g. team01, team01-qa, courses-dev-cgaucho, etc.
Received:
  The name of your Dokku app, e.g. team01,team01-qa, courses-dev-cgaucho, etc.

[Killed] LogicalOperator
main/components/DokkuScripts/DokkuScriptForm.jsx:67:35
                     data-testid={`${testId}-email`}
                     type="email"
                     isInvalid={Boolean(errors.email)}
-                    defaultValue={params.email || ""}
+                    defaultValue={params.email && ""}
                     {...register("email", {
                       required: "email is required.",
killedBy: HomePage tests uses values from local storage when set
statusReason: expected "spy" to be called with arguments: [ 'HomePage.params', …(1) ]

Number of calls: 0

[Killed] ConditionalExpression
main/components/DokkuScripts/DokkuScriptForm.jsx:67:35
                     data-testid={`${testId}-email`}
                     type="email"
                     isInvalid={Boolean(errors.email)}
-                    defaultValue={params.email || ""}
+                    defaultValue={false}
                     {...register("email", {
                       required: "email is required.",
killedBy: DokkuScript tests when form is submitted
statusReason: expected "spy" to be called with arguments: [ { appname: 'team01', …(5) } ]

Received: 

  1st spy call:

@@ -1,9 +1,9 @@
  [

[Killed] LogicalOperator
main/components/DokkuScripts/DokkuScriptForm.jsx:97:35
                     data-testid={`${testId}-org`}
                     type="text"
                     isInvalid={Boolean(errors.org)}
-                    defaultValue={params.org || ""}
+                    defaultValue={params.org && ""}
                     {...register("org", {
                       required: "org is required.",
killedBy: HomePage tests uses values from local storage when set
statusReason: expected "spy" to be called with arguments: [ 'HomePage.params', …(1) ]

Number of calls: 0

[Killed] ConditionalExpression
main/components/DokkuScripts/DokkuScriptForm.jsx:97:35
                     data-testid={`${testId}-org`}
                     type="text"
                     isInvalid={Boolean(errors.org)}
-                    defaultValue={params.org || ""}
+                    defaultValue={false}
                     {...register("org", {
                       required: "org is required.",
killedBy: DokkuScript tests when form is submitted
statusReason: expected "spy" to be called with arguments: [ { appname: 'team01', …(5) } ]

Received: 

  1st spy call:

@@ -2,9 +2,9 @@
    {

[Killed] ObjectLiteral
main/components/DokkuScripts/DokkuScriptForm.jsx:98:41
                     type="text"
                     isInvalid={Boolean(errors.org)}
                     defaultValue={params.org || ""}
-                    {...register("org", {
-                      required: "org is required.",
-                    })}
+                    {...register("org", {})}
                   />
                   <Form.Control.Feedback type="invalid">
killedBy: DokkuScript tests when form is submitted without filling in required fields
statusReason: Unable to find an element with the text: /org is required/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="py-5 DokkuScriptForm container"
      data-testid="DokkuScriptForm"

[Killed] OptionalChaining
main/components/DokkuScripts/DokkuScriptForm.jsx:103:22
                     })}
                   />
                   <Form.Control.Feedback type="invalid">
-                    {errors.org?.message}
+                    {errors.org.message}
                   </Form.Control.Feedback>
                 </Col>
killedBy: DokkuScript tests has expected attributes
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ConditionalExpression
main/components/DokkuScripts/DokkuScriptForm.jsx:126:35
                     data-testid={`${testId}-repo`}
                     type="text"
                     isInvalid={Boolean(errors.repo)}
-                    defaultValue={params.repo || ""}
+                    defaultValue={true}
                     {...register("repo", {
                       required: "repo is required.",
killedBy: DokkuScript tests when form is submitted
statusReason: expected "spy" to be called with arguments: [ { appname: 'team01', …(5) } ]

Received: 

  1st spy call:

@@ -3,8 +3,8 @@
      "appname": "team01",

[Killed] ConditionalExpression
main/components/DokkuScripts/DokkuScriptForm.jsx:126:35
                     data-testid={`${testId}-repo`}
                     type="text"
                     isInvalid={Boolean(errors.repo)}
-                    defaultValue={params.repo || ""}
+                    defaultValue={false}
                     {...register("repo", {
                       required: "repo is required.",
killedBy: DokkuScript tests when form is submitted
statusReason: expected "spy" to be called with arguments: [ { appname: 'team01', …(5) } ]

Received: 

  1st spy call:

@@ -3,8 +3,8 @@
      "appname": "team01",

[Killed] OptionalChaining
main/components/DokkuScripts/DokkuScriptForm.jsx:132:22
                     })}
                   />
                   <Form.Control.Feedback type="invalid">
-                    {errors.repo?.message}
+                    {errors.repo.message}
                   </Form.Control.Feedback>
                 </Col>
killedBy: DokkuScript tests has expected attributes
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] LogicalOperator
main/components/DokkuScripts/DokkuScriptForm.jsx:159:35
                     data-testid={`${testId}-google_client_id`}
                     type="text"
                     isInvalid={Boolean(errors.google_client_id)}
-                    defaultValue={params.google_client_id || ""}
+                    defaultValue={params.google_client_id && ""}
                     {...register("google_client_id", {
                       required: "Google Client ID is required.",
killedBy: HomePage tests uses values from local storage when set
statusReason: expected "spy" to be called with arguments: [ 'HomePage.params', …(1) ]

Number of calls: 0

[Killed] ConditionalExpression
main/components/DokkuScripts/DokkuScriptForm.jsx:159:35
                     data-testid={`${testId}-google_client_id`}
                     type="text"
                     isInvalid={Boolean(errors.google_client_id)}
-                    defaultValue={params.google_client_id || ""}
+                    defaultValue={true}
                     {...register("google_client_id", {
                       required: "Google Client ID is required.",
killedBy: DokkuScript tests when form is submitted
statusReason: expected "spy" to be called with arguments: [ { appname: 'team01', …(5) } ]

Received: 

  1st spy call:

  [
    {

[Killed] StringLiteral
main/components/DokkuScripts/DokkuScriptForm.jsx:161:33
                     isInvalid={Boolean(errors.google_client_id)}
                     defaultValue={params.google_client_id || ""}
                     {...register("google_client_id", {
-                      required: "Google Client ID is required.",
+                      required: "",
                     })}
                   />
killedBy: DokkuScript tests when form is submitted without filling in required fields
statusReason: Unable to find an element with the text: /Google Client Id is required/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="py-5 DokkuScriptForm container"
      data-testid="DokkuScriptForm"

[Killed] OptionalChaining
main/components/DokkuScripts/DokkuScriptForm.jsx:165:22
                     })}
                   />
                   <Form.Control.Feedback type="invalid">
-                    {errors.google_client_id?.message}
+                    {errors.google_client_id.message}
                   </Form.Control.Feedback>
                 </Col>
killedBy: DokkuScript tests has expected attributes
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/DokkuScripts/DokkuScriptForm.jsx:189:34
                 </Form.Label>
                 <Col sm={6}>
                   <Form.Control
-                    data-testid={`${testId}-google_client_secret`}
+                    data-testid={``}
                     type="text"
                     isInvalid={Boolean(errors.google_client_secret)}
killedBy: DokkuScript tests when form is submitted
statusReason: Unable to find an element by: [data-testid="DokkuScriptForm-google_client_secret"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="py-5 DokkuScriptForm container"
      data-testid="DokkuScriptForm"

[Killed] ConditionalExpression
main/components/DokkuScripts/DokkuScriptForm.jsx:192:35
                     data-testid={`${testId}-google_client_secret`}
                     type="text"
                     isInvalid={Boolean(errors.google_client_secret)}
-                    defaultValue={params.google_client_secret || ""}
+                    defaultValue={false}
                     {...register("google_client_secret", {
                       required: "Google Client Secret is required.",
killedBy: DokkuScript tests when form is submitted
statusReason: expected "spy" to be called with arguments: [ { appname: 'team01', …(5) } ]

Received: 

  1st spy call:

  [
    {

[Killed] LogicalOperator
main/components/DokkuScripts/DokkuScriptForm.jsx:192:35
                     data-testid={`${testId}-google_client_secret`}
                     type="text"
                     isInvalid={Boolean(errors.google_client_secret)}
-                    defaultValue={params.google_client_secret || ""}
+                    defaultValue={params.google_client_secret && ""}
                     {...register("google_client_secret", {
                       required: "Google Client Secret is required.",
killedBy: HomePage tests uses values from local storage when set
statusReason: expected "spy" to be called with arguments: [ 'HomePage.params', …(1) ]

Number of calls: 0

[Killed] OptionalChaining
main/components/DokkuScripts/DokkuScriptForm.jsx:198:22
                     })}
                   />
                   <Form.Control.Feedback type="invalid">
-                    {errors.google_client_secret?.message}
+                    {errors.google_client_secret.message}
                   </Form.Control.Feedback>
                 </Col>
killedBy: DokkuScript tests has expected attributes
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/DokkuScripts/DokkuScriptForm.jsx:204:34
                 <Col sm={4}>
                   <Form.Text
                     className="text-muted"
-                    data-testid={`${testId}-google_client_secret-help`}
+                    data-testid={``}
                   >
                     Google Client Secret for OAuth; see the project README for
killedBy: DokkuScript tests has expected help content
statusReason: Unable to find an element by: [data-testid="DokkuScriptForm-google_client_secret-help"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="py-5 DokkuScriptForm container"
      data-testid="DokkuScriptForm"
