[Killed] BlockStatement
src/main/pages/HomePage.jsx:12:32
 
   const testId = "HomePage";
 
-  const callback = (params) => {
-    setParams(params);
-    localStorage.setItem(`${testId}.params`, JSON.stringify(params));
-  };
+  const callback = (params) => {};
 
   localStorage.getItem(`${testId}.params`) &&
killedBy: HomePage tests uses values from local storage when set
statusReason: expected "spy" to be called with arguments: [ 'HomePage.params', …(1) ]

Number of calls: 0

[Killed] ConditionalExpression
src/main/pages/HomePage.jsx:17:3
     localStorage.setItem(`${testId}.params`, JSON.stringify(params));
   };
 
-  localStorage.getItem(`${testId}.params`) &&
-    !params &&
-    setParams(JSON.parse(localStorage.getItem(`${testId}.params`)));
+  false;
 
   return (
killedBy: HomePage tests uses values from local storage when set
statusReason: expect(element).toHaveValue(foobar)

Expected the element to have value:
  foobar
Received:

[Killed] LogicalOperator
src/main/pages/HomePage.jsx:17:3
     localStorage.setItem(`${testId}.params`, JSON.stringify(params));
   };
 
-  localStorage.getItem(`${testId}.params`) &&
-    !params &&
-    setParams(JSON.parse(localStorage.getItem(`${testId}.params`)));
+  localStorage.getItem(`${testId}.params`) && !params || setParams(JSON.parse(localStorage.getItem(`${testId}.params`)));
 
   return (
killedBy: HomePage tests renders without crashing
statusReason: Too many re-renders. React limits the number of renders to prevent an infinite loop.

[Killed] BooleanLiteral
src/main/pages/HomePage.jsx:18:5
   };
 
   localStorage.getItem(`${testId}.params`) &&
-    !params &&
+    params &&
     setParams(JSON.parse(localStorage.getItem(`${testId}.params`)));
 
killedBy: HomePage tests uses values from local storage when set
statusReason: expect(element).toHaveValue(foobar)

Expected the element to have value:
  foobar
Received:

[Killed] StringLiteral
src/main/pages/HomePage.jsx:19:47
 
   localStorage.getItem(`${testId}.params`) &&
     !params &&
-    setParams(JSON.parse(localStorage.getItem(`${testId}.params`)));
+    setParams(JSON.parse(localStorage.getItem(``)));
 
   return (
killedBy: HomePage tests uses values from local storage when set
statusReason: Too many re-renders. React limits the number of renders to prevent an infinite loop.
