[Killed] ArrowFunction
main/components/FrontiersApp/FrontiersAppFormDokku.jsx:16:46
 
   const formRef = useRef(null);
 
-  const servers = Array.from({ length: 17 }, (_, i) =>
-    i < 10 ? `0${i}` : `${i}`,
+  const servers = Array.from({ length: 17 }, () => undefined,
   );
   const serverUrl = `https://${watch("appName")}.dokku-${watch("dokkuServer")}.cs.ucsb.edu`;
killedBy: FrontiersAppFormDokku component tests submit test
statusReason: expected "submit" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] EqualityOperator
main/components/FrontiersApp/FrontiersAppFormDokku.jsx:17:5
   const formRef = useRef(null);
 
   const servers = Array.from({ length: 17 }, (_, i) =>
-    i < 10 ? `0${i}` : `${i}`,
+    i <= 10 ? `0${i}` : `${i}`,
   );
   const serverUrl = `https://${watch("appName")}.dokku-${watch("dokkuServer")}.cs.ucsb.edu`;
killedBy: FrontiersAppFormDokku component tests Various existence assertions
statusReason: Unable to find an element with the text: dokku-10. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container"
    >

[Killed] ConditionalExpression
main/components/FrontiersApp/FrontiersAppFormDokku.jsx:17:5
   const formRef = useRef(null);
 
   const servers = Array.from({ length: 17 }, (_, i) =>
-    i < 10 ? `0${i}` : `${i}`,
+    false ? `0${i}` : `${i}`,
   );
   const serverUrl = `https://${watch("appName")}.dokku-${watch("dokkuServer")}.cs.ucsb.edu`;
killedBy: FrontiersAppFormDokku component tests submit test
statusReason: expected "submit" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/components/FrontiersApp/FrontiersAppFormDokku.jsx:19:21
   const servers = Array.from({ length: 17 }, (_, i) =>
     i < 10 ? `0${i}` : `${i}`,
   );
-  const serverUrl = `https://${watch("appName")}.dokku-${watch("dokkuServer")}.cs.ucsb.edu`;
+  const serverUrl = ``;
 
   const appManifest = {
killedBy: FrontiersAppFormDokku component tests submit test
statusReason: 
Expected the element to have attribute:
Received:

[Killed] StringLiteral
main/components/FrontiersApp/FrontiersAppFormDokku.jsx:19:64
   const servers = Array.from({ length: 17 }, (_, i) =>
     i < 10 ? `0${i}` : `${i}`,
   );
-  const serverUrl = `https://${watch("appName")}.dokku-${watch("dokkuServer")}.cs.ucsb.edu`;
+  const serverUrl = `https://${watch("appName")}.dokku-${watch("")}.cs.ucsb.edu`;
 
   const appManifest = {
killedBy: FrontiersAppFormDokku component tests submit test
statusReason: 
Expected the element to have attribute:
Received:

[Killed] StringLiteral
main/components/FrontiersApp/FrontiersAppFormDokku.jsx:23:46
 
   const appManifest = {
     ...BaseFrontiersManifest,
-    name: `${watch("appName")}-dokku-${watch("dokkuServer")}`,
+    name: `${watch("appName")}-dokku-${watch("")}`,
     url: serverUrl,
     hook_attributes: {
killedBy: FrontiersAppFormDokku component tests submit test
statusReason: 
Expected the element to have attribute:
Received:

[Killed] ObjectLiteral
main/components/FrontiersApp/FrontiersAppFormDokku.jsx:25:22
     ...BaseFrontiersManifest,
     name: `${watch("appName")}-dokku-${watch("dokkuServer")}`,
     url: serverUrl,
-    hook_attributes: {
-      url: `${serverUrl}/api/webhooks/github`,
-    },
+    hook_attributes: {},
     default_events: ["organization"],
     redirect_url: `${window.location.origin}${window.location.pathname}/complete/dokku`,
killedBy: FrontiersAppFormDokku component tests submit test
statusReason: 
Expected the element to have attribute:
Received:

[Killed] ArrayDeclaration
main/components/FrontiersApp/FrontiersAppFormDokku.jsx:28:21
     hook_attributes: {
       url: `${serverUrl}/api/webhooks/github`,
     },
-    default_events: ["organization"],
+    default_events: [],
     redirect_url: `${window.location.origin}${window.location.pathname}/complete/dokku`,
     callback_urls: [
killedBy: FrontiersAppFormDokku component tests submit test
statusReason: 
Expected the element to have attribute:
Received:

[Killed] ArrayDeclaration
main/components/FrontiersApp/FrontiersAppFormDokku.jsx:30:20
     },
     default_events: ["organization"],
     redirect_url: `${window.location.origin}${window.location.pathname}/complete/dokku`,
-    callback_urls: [
-      `${serverUrl}/api/courses/link`,
-      `${serverUrl}/login/oauth2/code/github`,
-    ],
+    callback_urls: [],
   };
 
killedBy: FrontiersAppFormDokku component tests submit test
statusReason: 
Expected the element to have attribute:
Received:

[Killed] BlockStatement
main/components/FrontiersApp/FrontiersAppFormDokku.jsx:36:26
     ],
   };
 
-  const onSubmit = () => {
-    sessionStorage.setItem("frontiers-dokku-appname", watch("appName"));
-    formRef.current.submit();
-  };
+  const onSubmit = () => {};
 
   return (
killedBy: FrontiersAppFormDokku component tests submit test
statusReason: expected "submit" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/components/FrontiersApp/FrontiersAppFormDokku.jsx:37:61
   };
 
   const onSubmit = () => {
-    sessionStorage.setItem("frontiers-dokku-appname", watch("appName"));
+    sessionStorage.setItem("frontiers-dokku-appname", watch(""));
     formRef.current.submit();
   };
killedBy: FrontiersAppFormDokku component tests submit test
statusReason: expected 'undefined' to be 'test' // Object.is equality

[Killed] StringLiteral
main/components/FrontiersApp/FrontiersAppFormDokku.jsx:48:17
         data-testid="frontiers-app-form"
         onSubmit={handleSubmit(onSubmit)}
         method="POST"
-        action={`https://github.com/settings/apps/new?manifest=${encodeURIComponent(JSON.stringify(appManifest))}`}
+        action={``}
       >
         <Form.Group>
killedBy: FrontiersAppFormDokku component tests submit test
statusReason: 
Expected the element to have attribute:
Received:
  action=""

[Killed] BooleanLiteral
main/components/FrontiersApp/FrontiersAppFormDokku.jsx:56:25
             type="text"
             id="appName"
             placeholder="Enter app name"
-            isInvalid={!!errors.appName}
+            isInvalid={!errors.appName}
             {...register("appName", { required: true })}
           />
killedBy: FrontiersAppFormDokku component tests submit test
statusReason: expect(element).not.toHaveClass("is-invalid")

Expected the element not to have class:
  is-invalid
Received:
  form-control is-invalid

[Killed] BooleanLiteral
main/components/FrontiersApp/FrontiersAppFormDokku.jsx:57:49
             id="appName"
             placeholder="Enter app name"
             isInvalid={!!errors.appName}
-            {...register("appName", { required: true })}
+            {...register("appName", { required: false })}
           />
           <Form.Control.Feedback type="invalid">
killedBy: FrontiersAppFormDokku component tests Various existence assertions
statusReason: Unable to find an element with the text: App Name is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container"
    >

[Killed] LogicalOperator
main/components/FrontiersApp/FrontiersAppFormDokku.jsx:60:14
             {...register("appName", { required: true })}
           />
           <Form.Control.Feedback type="invalid">
-            {errors.appName && "App Name is required."}
+            {errors.appName || "App Name is required."}
           </Form.Control.Feedback>
           <Form.Label htmlFor="dokkuServer">Dokku Server</Form.Label>
killedBy: FrontiersAppFormDokku component tests Various existence assertions
statusReason: Unable to find an element with the text: Dokku Server is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ConditionalExpression
main/components/FrontiersApp/FrontiersAppFormDokku.jsx:60:14
             {...register("appName", { required: true })}
           />
           <Form.Control.Feedback type="invalid">
-            {errors.appName && "App Name is required."}
+            {true}
           </Form.Control.Feedback>
           <Form.Label htmlFor="dokkuServer">Dokku Server</Form.Label>
killedBy: FrontiersAppFormDokku component tests Various existence assertions
statusReason: Unable to find an element with the text: App Name is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container"
    >

[Killed] BooleanLiteral
main/components/FrontiersApp/FrontiersAppFormDokku.jsx:66:24
           <Form.Control
             as="select"
             id="dokkuServer"
-            isInvalid={!!errors.dokkuServer}
+            isInvalid={!errors.dokkuServer}
             {...register("dokkuServer", { required: true })}
           >
killedBy: FrontiersAppFormDokku component tests submit test
statusReason: expect(element).not.toHaveClass("is-invalid")

Expected the element not to have class:
  is-invalid
Received:
  form-control is-invalid

[Killed] BooleanLiteral
main/components/FrontiersApp/FrontiersAppFormDokku.jsx:67:53
             as="select"
             id="dokkuServer"
             isInvalid={!!errors.dokkuServer}
-            {...register("dokkuServer", { required: true })}
+            {...register("dokkuServer", { required: false })}
           >
             <option value="">Select a Dokku Server</option>
killedBy: FrontiersAppFormDokku component tests Various existence assertions
statusReason: Unable to find an element with the text: Dokku Server is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container"
    >

[Killed] ObjectLiteral
main/components/FrontiersApp/FrontiersAppFormDokku.jsx:67:41
             as="select"
             id="dokkuServer"
             isInvalid={!!errors.dokkuServer}
-            {...register("dokkuServer", { required: true })}
+            {...register("dokkuServer", {})}
           >
             <option value="">Select a Dokku Server</option>
killedBy: FrontiersAppFormDokku component tests Various existence assertions
statusReason: Unable to find an element with the text: Dokku Server is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container"
    >

[Killed] ArrowFunction
main/components/FrontiersApp/FrontiersAppFormDokku.jsx:70:26
             {...register("dokkuServer", { required: true })}
           >
             <option value="">Select a Dokku Server</option>
-            {servers.map((number) => (
-              <option key={number} value={number}>
-                dokku-{number}
-              </option>
-            ))}
+            {servers.map(() => undefined)}
           </Form.Control>
           <Form.Control.Feedback type="invalid">
killedBy: FrontiersAppFormDokku component tests submit test
statusReason: expected "submit" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] LogicalOperator
main/components/FrontiersApp/FrontiersAppFormDokku.jsx:77:14
             ))}
           </Form.Control>
           <Form.Control.Feedback type="invalid">
-            {errors.dokkuServer && "Dokku Server is required."}
+            {errors.dokkuServer || "Dokku Server is required."}
           </Form.Control.Feedback>
         </Form.Group>
killedBy: FrontiersAppFormDokku component tests Various existence assertions
statusReason: Unable to find an element with the text: App Name is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
main/components/FrontiersApp/FrontiersAppFormDokku.jsx:77:14
             ))}
           </Form.Control>
           <Form.Control.Feedback type="invalid">
-            {errors.dokkuServer && "Dokku Server is required."}
+            {true}
           </Form.Control.Feedback>
         </Form.Group>
killedBy: FrontiersAppFormDokku component tests Various existence assertions
statusReason: Unable to find an element with the text: Dokku Server is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container"
    >
