[Killed] StringLiteral
main/components/FrontiersApp/FrontiersAppFormLocalhost.jsx:15:21
   } = useForm();
 
   const formRef = useRef(null);
-  const serverUrl = `http://localhost:8080`;
+  const serverUrl = ``;
 
   const appManifest = {
killedBy: FrontiersAppFormLocalhost component tests submit test
statusReason: 
Expected the element to have attribute:
Received:

[Killed] StringLiteral
main/components/FrontiersApp/FrontiersAppFormLocalhost.jsx:19:20
 
   const appManifest = {
     ...BaseFrontiersManifest,
-    name: `${watch("appName")} on localhost`,
+    name: `${watch("")} on localhost`,
     url: serverUrl,
     redirect_url: `${window.location.origin}${window.location.pathname}/complete/localhost`,
killedBy: FrontiersAppFormLocalhost component tests submit test
statusReason: 
Expected the element to have attribute:
Received:

[Killed] BlockStatement
main/components/FrontiersApp/FrontiersAppFormLocalhost.jsx:28:26
     ],
   };
 
-  const onSubmit = () => {
-    formRef.current.submit();
-  };
+  const onSubmit = () => {};
 
   return (
killedBy: FrontiersAppFormLocalhost component tests submit test
statusReason: expected "submit" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div
