[Killed] BooleanLiteral
src/main/pages/FrontiersAppPage.jsx:18:29
           <Form.Label>Dokku or Localhost</Form.Label>
           <Form.Check
             inline
-            defaultChecked={true}
+            defaultChecked={false}
             type="radio"
             label="Dokku"
killedBy: FrontiersAppPage Page Tests page renders
statusReason: Unable to find an element by: [data-testid="frontiers-app-form"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
src/main/pages/FrontiersAppPage.jsx:23:26
             label="Dokku"
             value="dokku"
             id="dokku-radio"
-            {...register("dokkuOrLocalhost")}
+            {...register("")}
           />
           <Form.Check
killedBy: FrontiersAppPage Page Tests page renders
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
src/main/pages/FrontiersAppPage.jsx:31:26
             label="Localhost"
             value="localhost"
             id="localhost-radio"
-            {...register("dokkuOrLocalhost")}
+            {...register("")}
           />
         </Col>
killedBy: FrontiersAppPage Page Tests page renders
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] EqualityOperator
src/main/pages/FrontiersAppPage.jsx:36:10
         </Col>
       </Row>
       <Row>
-        {localhostOrDokku === "dokku" ? (
+        {localhostOrDokku !== "dokku" ? (
           <FrontiersAppFormDokku />
         ) : (
killedBy: FrontiersAppPage Page Tests page renders
statusReason: Unable to find an element by: [data-testid="frontiers-app-form"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/FrontiersAppPage.jsx:36:10
         </Col>
       </Row>
       <Row>
-        {localhostOrDokku === "dokku" ? (
+        {true ? (
           <FrontiersAppFormDokku />
         ) : (
killedBy: FrontiersAppPage Page Tests page renders
statusReason: Unable to find an element by: [data-testid="frontiers-app-form-localhost"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
