[Killed] StringLiteral
src/main/pages/FrontiersAppReturnDokku.jsx:8:60
 import forge from "node-forge";
 
 export default function FrontiersAppReturnDokku() {
-  const [searchParams, _setSearchParams] = useSearchParams("code");
+  const [searchParams, _setSearchParams] = useSearchParams("");
   const [resultData, setResultData] = useState(null);
   const [resultError, setResultError] = useState(false);
killedBy: FrontiersAppReturnDokku Page Tests no code
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p>
  Something went wrong; The app code could not be exchanged for credentials.
</p> instead

[Killed] BooleanLiteral
src/main/pages/FrontiersAppReturnDokku.jsx:10:50
 export default function FrontiersAppReturnDokku() {
   const [searchParams, _setSearchParams] = useSearchParams("code");
   const [resultData, setResultData] = useState(null);
-  const [resultError, setResultError] = useState(false);
+  const [resultError, setResultError] = useState(true);
   useEffect(() => {
     if (searchParams.get("code") !== "") {
killedBy: FrontiersAppReturnDokku Page Tests no code
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p>
  Something went wrong; The app code could not be exchanged for credentials.
</p> instead

[Killed] BlockStatement
src/main/pages/FrontiersAppReturnDokku.jsx:11:19
   const [searchParams, _setSearchParams] = useSearchParams("code");
   const [resultData, setResultData] = useState(null);
   const [resultError, setResultError] = useState(false);
-  useEffect(() => {
-    if (searchParams.get("code") !== "") {
-      axios
-        .post(
-          `https://api.github.com/app-manifests/${searchParams.get("code")}/conversions`,
-        )
-        .then((response) => {
-          const pem = forge.pki.privateKeyFromPem(response.data.pem);
-
-          const rsaPrivateKey = forge.pki.privateKeyToAsn1(pem);
-
-          const privateKeyInfo = forge.pki.wrapRsaPrivateKey(rsaPrivateKey);
-
-          response.data.pkcs8 = forge.pki.privateKeyInfoToPem(privateKeyInfo);
-
-          setResultData(response.data);
-        })
-        .catch((error) => {
-          setResultError(true);
-          console.error("failed to create app on GitHub: " + error);
-        });
-    }
-  }, [searchParams]);
+  useEffect(() => {}, [searchParams]);
 
   const appName =
killedBy: FrontiersAppReturnDokku Page Tests Happy Path
statusReason: Unable to find an element with the text: /APP_PRIVATE_KEY="fake-private-key"/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/FrontiersAppReturnDokku.jsx:12:9
   const [resultData, setResultData] = useState(null);
   const [resultError, setResultError] = useState(false);
   useEffect(() => {
-    if (searchParams.get("code") !== "") {
+    if (true) {
       axios
         .post(
killedBy: FrontiersAppReturnDokku Page Tests no code
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p>
  Something went wrong; The app code could not be exchanged for credentials.
</p> instead

[Killed] BlockStatement
src/main/pages/FrontiersAppReturnDokku.jsx:12:42
   const [resultData, setResultData] = useState(null);
   const [resultError, setResultError] = useState(false);
   useEffect(() => {
-    if (searchParams.get("code") !== "") {
-      axios
-        .post(
-          `https://api.github.com/app-manifests/${searchParams.get("code")}/conversions`,
-        )
-        .then((response) => {
-          const pem = forge.pki.privateKeyFromPem(response.data.pem);
-
-          const rsaPrivateKey = forge.pki.privateKeyToAsn1(pem);
-
-          const privateKeyInfo = forge.pki.wrapRsaPrivateKey(rsaPrivateKey);
-
-          response.data.pkcs8 = forge.pki.privateKeyInfoToPem(privateKeyInfo);
-
-          setResultData(response.data);
-        })
-        .catch((error) => {
-          setResultError(true);
-          console.error("failed to create app on GitHub: " + error);
-        });
-    }
+    if (searchParams.get("code") !== "") {}
   }, [searchParams]);
 
killedBy: FrontiersAppReturnDokku Page Tests Happy Path
statusReason: Unable to find an element with the text: /APP_PRIVATE_KEY="fake-private-key"/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
src/main/pages/FrontiersAppReturnDokku.jsx:15:11
     if (searchParams.get("code") !== "") {
       axios
         .post(
-          `https://api.github.com/app-manifests/${searchParams.get("code")}/conversions`,
+          ``,
         )
         .then((response) => {
killedBy: FrontiersAppReturnDokku Page Tests Happy Path
statusReason: Unable to find an element with the text: /APP_PRIVATE_KEY="fake-private-key"/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
src/main/pages/FrontiersAppReturnDokku.jsx:17:29
         .post(
           `https://api.github.com/app-manifests/${searchParams.get("code")}/conversions`,
         )
-        .then((response) => {
-          const pem = forge.pki.privateKeyFromPem(response.data.pem);
-
-          const rsaPrivateKey = forge.pki.privateKeyToAsn1(pem);
-
-          const privateKeyInfo = forge.pki.wrapRsaPrivateKey(rsaPrivateKey);
-
-          response.data.pkcs8 = forge.pki.privateKeyInfoToPem(privateKeyInfo);
-
-          setResultData(response.data);
-        })
+        .then((response) => {})
         .catch((error) => {
           setResultError(true);
killedBy: FrontiersAppReturnDokku Page Tests Happy Path
statusReason: Unable to find an element with the text: /APP_PRIVATE_KEY="fake-private-key"/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
src/main/pages/FrontiersAppReturnDokku.jsx:28:27
 
           setResultData(response.data);
         })
-        .catch((error) => {
-          setResultError(true);
-          console.error("failed to create app on GitHub: " + error);
-        });
+        .catch((error) => {});
     }
   }, [searchParams]);
killedBy: FrontiersAppReturnDokku Page Tests bad github response
statusReason: Unable to find an element with the text: /The app code could not be exchanged for credentials/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BooleanLiteral
src/main/pages/FrontiersAppReturnDokku.jsx:29:26
           setResultData(response.data);
         })
         .catch((error) => {
-          setResultError(true);
+          setResultError(false);
           console.error("failed to create app on GitHub: " + error);
         });
killedBy: FrontiersAppReturnDokku Page Tests bad github response
statusReason: Unable to find an element with the text: /The app code could not be exchanged for credentials/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
src/main/pages/FrontiersAppReturnDokku.jsx:30:25
         })
         .catch((error) => {
           setResultError(true);
-          console.error("failed to create app on GitHub: " + error);
+          console.error("" + error);
         });
     }
killedBy: FrontiersAppReturnDokku Page Tests bad github response
statusReason: expected 'Error: Request failed with status cod…' to contain 'failed to create app on GitHub:'

[Killed] ConditionalExpression
src/main/pages/FrontiersAppReturnDokku.jsx:36:5
   }, [searchParams]);
 
   const appName =
-    sessionStorage.getItem("frontiers-dokku-appname") || "<appname>";
+    false;
 
   return (
killedBy: FrontiersAppReturnDokku Page Tests Happy Path
statusReason: Unable to find an element with the text: /dokku config:set --no-restart test-app/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
src/main/pages/FrontiersAppReturnDokku.jsx:36:5
   }, [searchParams]);
 
   const appName =
-    sessionStorage.getItem("frontiers-dokku-appname") || "<appname>";
+    sessionStorage.getItem("frontiers-dokku-appname") && "<appname>";
 
   return (
killedBy: FrontiersAppReturnDokku Page Tests Happy Path
statusReason: Unable to find an element with the text: /dokku config:set --no-restart test-app/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/FrontiersAppReturnDokku.jsx:42:10
     <BasicLayout>
       <div>
         <h2>Dokku Commands</h2>
-        {!searchParams.get("code") && (
-          <>
-            <p>
-              Something went wrong; Github did not provide an app creation code.
-            </p>
-          </>
-        )}
+        {true}
         {resultError && (
           <>
killedBy: FrontiersAppReturnDokku Page Tests no code
statusReason: Unable to find an element with the text: /Github did not provide an app creation code/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
src/main/pages/FrontiersAppReturnDokku.jsx:42:10
     <BasicLayout>
       <div>
         <h2>Dokku Commands</h2>
-        {!searchParams.get("code") && (
-          <>
-            <p>
-              Something went wrong; Github did not provide an app creation code.
-            </p>
-          </>
-        )}
+        {!searchParams.get("code") || <>
+            <p>
+              Something went wrong; Github did not provide an app creation code.
+            </p>
+          </>}
         {resultError && (
           <>
killedBy: FrontiersAppReturnDokku Page Tests no code
statusReason: Unable to find an element with the text: /Github did not provide an app creation code/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/FrontiersAppReturnDokku.jsx:49:10
             </p>
           </>
         )}
-        {resultError && (
-          <>
-            <p>
-              Something went wrong; The app code could not be exchanged for
-              credentials.
-            </p>
-          </>
-        )}
+        {true}
         {resultData && (
           <>
killedBy: FrontiersAppReturnDokku Page Tests bad github response
statusReason: Unable to find an element with the text: /The app code could not be exchanged for credentials/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
src/main/pages/FrontiersAppReturnDokku.jsx:49:10
             </p>
           </>
         )}
-        {resultError && (
-          <>
-            <p>
-              Something went wrong; The app code could not be exchanged for
-              credentials.
-            </p>
-          </>
-        )}
+        {resultError || <>
+            <p>
+              Something went wrong; The app code could not be exchanged for
+              credentials.
+            </p>
+          </>}
         {resultData && (
           <>
killedBy: FrontiersAppReturnDokku Page Tests no code
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p>
  Something went wrong; The app code could not be exchanged for credentials.
</p> instead

[Killed] ConditionalExpression
src/main/pages/FrontiersAppReturnDokku.jsx:57:10
             </p>
           </>
         )}
-        {resultData && (
-          <>
-            <p>Run the following commands on dokku:</p>
-            <code>
-              {/*prettier-ignore*/}
-              <pre>
-                dokku config:set --no-restart {appName} APP_PRIVATE_KEY="{resultData.pkcs8}" <br />
-                dokku config:set --no-restart {appName} GITHUB_CLIENT_ID="{resultData.client_id}" <br />
-                dokku config:set --no-restart {appName} GITHUB_CLIENT_SECRET="{resultData.client_secret}" <br />
-                dokku config:set {appName} WEBHOOK_SECRET="{resultData.webhook_secret}"
-              </pre>
-            </code>
-          </>
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: FrontiersAppReturnDokku Page Tests Happy Path
statusReason: Unable to find an element with the text: /APP_PRIVATE_KEY="fake-private-key"/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
src/main/pages/FrontiersAppReturnDokku.jsx:57:10
             </p>
           </>
         )}
-        {resultData && (
-          <>
-            <p>Run the following commands on dokku:</p>
-            <code>
-              {/*prettier-ignore*/}
-              <pre>
-                dokku config:set --no-restart {appName} APP_PRIVATE_KEY="{resultData.pkcs8}" <br />
-                dokku config:set --no-restart {appName} GITHUB_CLIENT_ID="{resultData.client_id}" <br />
-                dokku config:set --no-restart {appName} GITHUB_CLIENT_SECRET="{resultData.client_secret}" <br />
-                dokku config:set {appName} WEBHOOK_SECRET="{resultData.webhook_secret}"
-              </pre>
-            </code>
-          </>
-        )}
+        {resultData || <>
+            <p>Run the following commands on dokku:</p>
+            <code>
+              {/*prettier-ignore*/}
+              <pre>
+                dokku config:set --no-restart {appName} APP_PRIVATE_KEY="{resultData.pkcs8}" <br />
+                dokku config:set --no-restart {appName} GITHUB_CLIENT_ID="{resultData.client_id}" <br />
+                dokku config:set --no-restart {appName} GITHUB_CLIENT_SECRET="{resultData.client_secret}" <br />
+                dokku config:set {appName} WEBHOOK_SECRET="{resultData.webhook_secret}"
+              </pre>
+            </code>
+          </>}
       </div>
     </BasicLayout>
killedBy: FrontiersAppReturnDokku Page Tests Happy Path
statusReason: Cannot read properties of null (reading 'pkcs8')
