[Killed] ConditionalExpression
src/main/pages/FrontiersAppReturnLocalhost.jsx:14:9
   const [resultData, setResultData] = useState(null);
   const [resultError, setResultError] = useState(false);
   useEffect(() => {
-    if (searchParams.get("code") !== "") {
+    if (false) {
       axios
         .post(
killedBy: FrontiersAppReturnLocalhost page tests Happy Path
statusReason: Unable to find an element with the text: /GITHUB_CLIENT_ID="test-client-id"/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
src/main/pages/FrontiersAppReturnLocalhost.jsx:37:38
     }
   }, [searchParams]);
 
-  const downloadableCallback = () => {
-    const blob = new Blob([exportSecretsYaml(resultData.pkcs8)], {
-      type: "text/plain",
-    });
-    const url = URL.createObjectURL(blob);
-    const link = document.createElement("a");
-    link.href = url;
-    link.download = "secrets.yaml";
-    document.body.appendChild(link);
-    link.click();
-    link.remove();
-    URL.revokeObjectURL(url);
-  };
+  const downloadableCallback = () => {};
 
   return (
killedBy: FrontiersAppReturnLocalhost page tests Happy Path
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrayDeclaration
src/main/pages/FrontiersAppReturnLocalhost.jsx:38:27
   }, [searchParams]);
 
   const downloadableCallback = () => {
-    const blob = new Blob([exportSecretsYaml(resultData.pkcs8)], {
+    const blob = new Blob([], {
       type: "text/plain",
     });
killedBy: FrontiersAppReturnLocalhost page tests Happy Path
statusReason: expected "spy" to be called with arguments: [ [ 'fake-private-key' ], …(1) ]

Received: 

  1st spy call:

  [
-   [

[Killed] StringLiteral
src/main/pages/FrontiersAppReturnLocalhost.jsx:39:13
 
   const downloadableCallback = () => {
     const blob = new Blob([exportSecretsYaml(resultData.pkcs8)], {
-      type: "text/plain",
+      type: "",
     });
     const url = URL.createObjectURL(blob);
killedBy: FrontiersAppReturnLocalhost page tests Happy Path
statusReason: expected "spy" to be called with arguments: [ [ 'fake-private-key' ], …(1) ]

Received: 

  1st spy call:

  [
    [

[Killed] ConditionalExpression
src/main/pages/FrontiersAppReturnLocalhost.jsx:55:10
     <BasicLayout>
       <div>
         <h2>Localhost Configuration</h2>
-        {!searchParams.get("code") && (
-          <>
-            <p>
-              Something went wrong; Github did not provide an app creation code.
-            </p>
-          </>
-        )}
+        {true}
         {resultError && (
           <>
killedBy: FrontiersAppReturnLocalhost page tests no code
statusReason: Unable to find an element with the text: /Github did not provide an app creation code/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BooleanLiteral
src/main/pages/FrontiersAppReturnLocalhost.jsx:55:10
     <BasicLayout>
       <div>
         <h2>Localhost Configuration</h2>
-        {!searchParams.get("code") && (
+        {searchParams.get("code") && (
           <>
             <p>
killedBy: FrontiersAppReturnLocalhost page tests no code
statusReason: Unable to find an element with the text: /Github did not provide an app creation code/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/FrontiersAppReturnLocalhost.jsx:62:10
             </p>
           </>
         )}
-        {resultError && (
-          <>
-            <p>
-              Something went wrong; The app code could not be exchanged for
-              credentials.
-            </p>
-          </>
-        )}
+        {false}
         {resultData && (
           <>
killedBy: FrontiersAppReturnLocalhost page tests bad github response
statusReason: Unable to find an element with the text: /The app code could not be exchanged for credentials/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/FrontiersAppReturnLocalhost.jsx:70:10
             </p>
           </>
         )}
-        {resultData && (
-          <>
-            <Row>
-              <p>Add the following lines to your .env:</p>
-              <code>
-                {/*prettier-ignore*/}
-                <pre>
-                GITHUB_CLIENT_ID="{resultData.client_id}" <br />
-                GITHUB_CLIENT_SECRET="{resultData.client_secret}" <br />
-                </pre>
-              </code>
-            </Row>
-            <Row className="pb-2">
-              <Col>
-                <p>Download your private key:</p>
-                <Button onClick={downloadableCallback}>
-                  Download Private Key
-                </Button>
-              </Col>
-            </Row>
-          </>
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: FrontiersAppReturnLocalhost page tests Happy Path
statusReason: Unable to find an element with the text: /GITHUB_CLIENT_ID="test-client-id"/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/FrontiersAppReturnLocalhost.jsx:70:10
             </p>
           </>
         )}
-        {resultData && (
-          <>
-            <Row>
-              <p>Add the following lines to your .env:</p>
-              <code>
-                {/*prettier-ignore*/}
-                <pre>
-                GITHUB_CLIENT_ID="{resultData.client_id}" <br />
-                GITHUB_CLIENT_SECRET="{resultData.client_secret}" <br />
-                </pre>
-              </code>
-            </Row>
-            <Row className="pb-2">
-              <Col>
-                <p>Download your private key:</p>
-                <Button onClick={downloadableCallback}>
-                  Download Private Key
-                </Button>
-              </Col>
-            </Row>
-          </>
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: FrontiersAppReturnLocalhost page tests Happy Path
statusReason: Unable to find an element with the text: /GITHUB_CLIENT_ID="test-client-id"/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
