[Killed] BlockStatement
src/main/utils/SecretsYamlUtil.js:1:38
-const exportSecretsYaml = (pkcs8) => {
-  const yaml = `
-app:
-  private:
-    key: "${pkcs8}"
-`;
-
-  return yaml;
-};
+const exportSecretsYaml = (pkcs8) => {};
 
 export { exportSecretsYaml };
killedBy: simple secretsYamlUtil test
statusReason: expected undefined to be '\napp:\n  private:\n    key: "key"\n' // Object.is equality
