[Killed] ObjectLiteral
src/main/utils/BaseFrontiersConfiguration.js:2:24
 export const BaseFrontiersManifest = {
-  default_permissions: {
-    administration: "write",
-    contents: "write",
-    workflows: "write",
-    organization_administration: "write",
-    members: "write",
-  },
+  default_permissions: {},
   request_oauth_on_install: true,
   public: true,
killedBy: FrontiersAppFormDokku component tests submit test
statusReason: 
Expected the element to have attribute:
Received:

[Killed] StringLiteral
src/main/utils/BaseFrontiersConfiguration.js:7:14
     contents: "write",
     workflows: "write",
     organization_administration: "write",
-    members: "write",
+    members: "",
   },
   request_oauth_on_install: true,
killedBy: FrontiersAppFormLocalhost component tests submit test
statusReason: 
Expected the element to have attribute:
Received:

[Killed] BooleanLiteral
src/main/utils/BaseFrontiersConfiguration.js:9:29
     organization_administration: "write",
     members: "write",
   },
-  request_oauth_on_install: true,
+  request_oauth_on_install: false,
   public: true,
 };
killedBy: FrontiersAppFormLocalhost component tests submit test
statusReason: 
Expected the element to have attribute:
Received:

[Killed] BooleanLiteral
src/main/utils/BaseFrontiersConfiguration.js:10:11
     members: "write",
   },
   request_oauth_on_install: true,
-  public: true,
+  public: false,
 };
 
killedBy: FrontiersAppFormLocalhost component tests submit test
statusReason: 
Expected the element to have attribute:
Received:
