[Killed] ObjectLiteral
main/components/FrontiersApp/FrontiersAppFormDokku.jsx:56:37
             id="appName"
             placeholder="Enter app name"
             isInvalid={!!errors.appName}
-            {...register("appName", { required: true })}
+            {...register("appName", {})}
           />
           <Form.Control.Feedback type="invalid">
killedBy: FrontiersAppFormDokku component tests Various existence assertions
statusReason: Unable to find an element with the text: App Name is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container"
    >

[Killed] ConditionalExpression
main/components/FrontiersApp/FrontiersAppFormDokku.jsx:59:14
             {...register("appName", { required: true })}
           />
           <Form.Control.Feedback type="invalid">
-            {errors.appName && "App Name is required."}
+            {false}
           </Form.Control.Feedback>
           <Form.Label htmlFor="dokkuServer">Dokku Server</Form.Label>
killedBy: FrontiersAppFormDokku component tests Various existence assertions
statusReason: Unable to find an element with the text: App Name is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container"
    >

[Killed] ConditionalExpression
main/components/FrontiersApp/FrontiersAppFormDokku.jsx:76:14
             ))}
           </Form.Control>
           <Form.Control.Feedback type="invalid">
-            {errors.dokkuServer && "Dokku Server is required."}
+            {false}
           </Form.Control.Feedback>
         </Form.Group>
killedBy: FrontiersAppFormDokku component tests Various existence assertions
statusReason: Unable to find an element with the text: Dokku Server is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container"
    >
