[Killed] ConditionalExpression
src/main/pages/FrontiersAppReturnDokku.jsx:39:10
     <BasicLayout>
       <div>
         <h2>Dokku Commands</h2>
-        {!searchParams.get("code") && (
-          <>
-            <p>
-              Something went wrong; Github did not provide an app creation code.
-            </p>
-          </>
-        )}
+        {false}
         {resultError && (
           <>
killedBy: FrontiersAppReturnDokku Page Tests no code
statusReason: Unable to find an element with the text: /Github did not provide an app creation code/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BooleanLiteral
src/main/pages/FrontiersAppReturnDokku.jsx:39:10
     <BasicLayout>
       <div>
         <h2>Dokku Commands</h2>
-        {!searchParams.get("code") && (
+        {searchParams.get("code") && (
           <>
             <p>
killedBy: FrontiersAppReturnDokku Page Tests no code
statusReason: Unable to find an element with the text: /Github did not provide an app creation code/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/FrontiersAppReturnDokku.jsx:54:10
             </p>
           </>
         )}
-        {resultData && (
-          <>
-            <p>Run the following commands on dokku:</p>
-            <code>
-              {/*prettier-ignore*/}
-              <pre>
-                dokku config:set --no-restart {"<appname>"} APP_PRIVATE_KEY="{resultData.pkcs8}" <br />
-                dokku config:set --no-restart {"<appname>"} GITHUB_CLIENT_ID="{resultData.client_id}" <br />
-                dokku config:set --no-restart {"<appname>"} GITHUB_CLIENT_SECRET="{resultData.client_secret}" <br />
-                dokku config:set {"<appname>"} WEBHOOK_SECRET="{resultData.webhook_secret}"
-              </pre>
-            </code>
-          </>
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: FrontiersAppReturnDokku Page Tests Happy Path
statusReason: Unable to find an element with the text: /APP_PRIVATE_KEY="fake-private-key"/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
src/main/pages/FrontiersAppReturnDokku.jsx:54:10
             </p>
           </>
         )}
-        {resultData && (
-          <>
-            <p>Run the following commands on dokku:</p>
-            <code>
-              {/*prettier-ignore*/}
-              <pre>
-                dokku config:set --no-restart {"<appname>"} APP_PRIVATE_KEY="{resultData.pkcs8}" <br />
-                dokku config:set --no-restart {"<appname>"} GITHUB_CLIENT_ID="{resultData.client_id}" <br />
-                dokku config:set --no-restart {"<appname>"} GITHUB_CLIENT_SECRET="{resultData.client_secret}" <br />
-                dokku config:set {"<appname>"} WEBHOOK_SECRET="{resultData.webhook_secret}"
-              </pre>
-            </code>
-          </>
-        )}
+        {resultData || <>
+            <p>Run the following commands on dokku:</p>
+            <code>
+              {/*prettier-ignore*/}
+              <pre>
+                dokku config:set --no-restart {"<appname>"} APP_PRIVATE_KEY="{resultData.pkcs8}" <br />
+                dokku config:set --no-restart {"<appname>"} GITHUB_CLIENT_ID="{resultData.client_id}" <br />
+                dokku config:set --no-restart {"<appname>"} GITHUB_CLIENT_SECRET="{resultData.client_secret}" <br />
+                dokku config:set {"<appname>"} WEBHOOK_SECRET="{resultData.webhook_secret}"
+              </pre>
+            </code>
+          </>}
       </div>
     </BasicLayout>
killedBy: FrontiersAppReturnDokku Page Tests Happy Path
statusReason: Cannot read properties of null (reading 'pkcs8')
