[Survived] ObjectLiteral
main/components/DokkuScripts/DokkuScriptForm.jsx:213:26
               </Form.Group>
 
               <Form.Group as={Row} className="mb-3" controlId="mongo">
-                <Col sm={{ span: 6, offset: 2 }}>
+                <Col sm={{}}>
                   <Form.Check
                     type="checkbox"

[Killed] BooleanLiteral
main/components/DokkuScripts/DokkuScriptForm.jsx:218:53
                     type="checkbox"
                     label="Enable MongoDB"
                     data-testid={`${testId}-mongo`}
-                    defaultChecked={params.mongo || false}
+                    defaultChecked={params.mongo || true}
                     {...register("mongo")}
                   />
killedBy: DokkuScript tests when form is submitted
statusReason: expected "spy" to be called with arguments: [ { appname: 'team01', …(6) } ]

Received: 

  1st spy call:

@@ -2,10 +2,10 @@
    {

[Killed] ConditionalExpression
main/components/DokkuScripts/DokkuScriptForm.jsx:218:37
                     type="checkbox"
                     label="Enable MongoDB"
                     data-testid={`${testId}-mongo`}
-                    defaultChecked={params.mongo || false}
+                    defaultChecked={true}
                     {...register("mongo")}
                   />
killedBy: DokkuScript tests when form is submitted
statusReason: expected "spy" to be called with arguments: [ { appname: 'team01', …(6) } ]

Received: 

  1st spy call:

@@ -2,10 +2,10 @@
    {
