[Killed] BooleanLiteral
main/components/DokkuScripts/DokkuScriptGenerate.jsx:10:11
   repo = "proj-happycows",
   google_client_id = "get-value-from-google",
   google_client_secret = "get-value-from-google",
-  mongo = false,
+  mongo = true,
 }) {
   const mongoInstructions = mongo
killedBy: DokkuScript tests defaults
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:

  dokku apps:create happycows
  dokku git:set happycows keep-git-dir true
  dokku config:set --no-restart happycows PRODUCTION=true
  dokku config:set --no-restart happycows SOURCE_REPO=https://github.com/ucsb-cs156/proj-happycows

[Killed] StringLiteral
main/components/DokkuScripts/DokkuScriptGenerate.jsx:13:7
   mongo = false,
 }) {
   const mongoInstructions = mongo
-    ? `
-      dokku mongo:create ${appname}-m
-      dokku mongo:link ${appname}-m ${appname}`
+    ? ``
     : "";
 
killedBy: DokkuScript tests includes mongo instructions when mongo is true
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:

  dokku apps:create happycows
  dokku git:set happycows keep-git-dir true
  dokku config:set --no-restart happycows PRODUCTION=true
  dokku config:set --no-restart happycows SOURCE_REPO=https://github.com/ucsb-cs156/proj-happycows

[Killed] ObjectLiteral
main/components/DokkuScripts/DokkuScriptGenerate.jsx:35:17
 `;
 
   return (
-    <pre style={{ whiteSpace: "pre" }} data-testid="dokkuscript">
+    <pre style={{}} data-testid="dokkuscript">
       {content}
     </pre>
killedBy: DokkuScript tests has expected attributes
statusReason: expect(element).toHaveAttribute("style", "white-space: pre;") // element.getAttribute("style") === "white-space: pre;"

Expected the element to have attribute:
  style="white-space: pre;"
Received:
  null
