[Killed] StringLiteral
main/components/DokkuScripts/DokkuScriptForm.jsx:221:34
                     type="checkbox"
                     data-testid={`${testId}-mongo`}
                     defaultChecked={params.mongo || false}
-                    {...register("mongo")}
+                    {...register("")}
                   />
                 </Col>
killedBy: DokkuScript tests has expected attributes
statusReason: Cannot read properties of undefined (reading '_f')
