[Killed] StringLiteral
main/components/DokkuScripts/DokkuScriptGenerate.jsx:21:7
     : "";
 
   const ucsbApiInstructions = ucsb_api
-    ? `
-      dokku config:set ${appname} UCSB_API_KEY=${ucsb_api_key} --no-restart`
+    ? ``
     : "";
 
killedBy: DokkuScript tests includes ucsb_api instructions when ucsb_api is true
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:

  dokku apps:create happycows
  dokku git:set happycows keep-git-dir true
  dokku config:set --no-restart happycows PRODUCTION=true
  dokku config:set --no-restart happycows SOURCE_REPO=https://github.com/ucsb-cs156/proj-happycows
