[Killed] BlockStatement
main/components/DokkuScripts/DokkuScriptForm.jsx:5:37
 import { Form, Button, Container, Row, Col, Card } from "react-bootstrap";
 import { useForm } from "react-hook-form";
 
-const defaultCallback = (result) => {
-  window.alert(`Form submitted: ${JSON.stringify(result)}`);
-};
+const defaultCallback = (result) => {};
 
 function DokkuScriptForm({ callback = defaultCallback }) {
killedBy: DokkuScript tests when form is submitted with default callback, window.alert is called
statusReason: expected "bound " to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
main/components/DokkuScripts/DokkuScriptForm.jsx:23:48
           <Card className="shadow-sm p-4">
             <h3 className="mb-4 text-center">Specify your Dokku App</h3>
             <Form
-              onSubmit={handleSubmit((data) => {
-                callback(data);
-              })}
+              onSubmit={handleSubmit((data) => {})}
             >
               <Form.Group as={Row} className="mb-3" controlId="appname">
killedBy: DokkuScript tests when form is submitted
statusReason: expected "spy" to be called with arguments: [ { appname: 'team01' } ]

Number of calls: 0

[Killed] StringLiteral
main/components/DokkuScripts/DokkuScriptForm.jsx:33:34
                 </Form.Label>
                 <Col sm={6}>
                   <Form.Control
-                    data-testid={`${testId}-appname`}
+                    data-testid={``}
                     type="text"
                     isInvalid={Boolean(errors.appname)}
killedBy: DokkuScript tests when form is submitted
statusReason: Unable to find an element by: [data-testid="DokkuScriptForm-appname"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="py-5 DokkuScriptForm container"
      data-testid="DokkuScriptForm"

[Killed] ObjectLiteral
main/components/DokkuScripts/DokkuScriptForm.jsx:36:45
                     data-testid={`${testId}-appname`}
                     type="text"
                     isInvalid={Boolean(errors.appname)}
-                    {...register("appname", {
-                      required: "appname is required.",
-                    })}
+                    {...register("appname", {})}
                   />
                   <Form.Control.Feedback type="invalid">
killedBy: DokkuScript tests when form is submitted without filling in required fields
statusReason: Unable to find an element with the text: /appname is required/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="py-5 DokkuScriptForm container"
      data-testid="DokkuScriptForm"

[Killed] OptionalChaining
main/components/DokkuScripts/DokkuScriptForm.jsx:41:22
                     })}
                   />
                   <Form.Control.Feedback type="invalid">
-                    {errors.appname?.message}
+                    {errors.appname.message}
                   </Form.Control.Feedback>
                 </Col>
killedBy: DokkuScript tests has expected attributes
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/DokkuScripts/DokkuScriptForm.jsx:47:34
                 <Col sm={4}>
                   <Form.Text
                     className="text-muted"
-                    data-testid={`${testId}-appname-help`}
+                    data-testid={``}
                   >
                     The name of your Dokku app, e.g. <code>team01</code>,{" "}
killedBy: DokkuScript tests has expected content
statusReason: Unable to find an element by: [data-testid="DokkuScriptForm-appname-help"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="py-5 DokkuScriptForm container"
      data-testid="DokkuScriptForm"
