[Killed] ArrowFunction
src/main/components/OurTable.jsx:14:32
 
 function OurTable({ data, columns, testid = "testid" }) {
   // Stryker disable next-line ArrayDeclaration : for [data]
-  const memoizedData = useMemo(() => data, [data]);
+  const memoizedData = useMemo(() => undefined, [data]);
   // Stryker disable next-line ArrayDeclaration : for [columns]
   const memoizedColumns = useMemo(() => columns, [columns]);
killedBy: OurTable tests renders an empty table without crashing
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ArrowFunction
src/main/components/OurTable.jsx:16:35
   // Stryker disable next-line ArrayDeclaration : for [data]
   const memoizedData = useMemo(() => data, [data]);
   // Stryker disable next-line ArrayDeclaration : for [columns]
-  const memoizedColumns = useMemo(() => columns, [columns]);
+  const memoizedColumns = useMemo(() => undefined, [columns]);
 
   const table = useReactTable({
killedBy: OurTable tests renders an empty table without crashing
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
src/main/components/OurTable.jsx:34:38
             // Stryker disable next-line StringLiteral : React key property not exposed in dom
             key={`${testid}-header-group-${i}`}
           >
-            {headerGroup.headers.map((header) => (
-              <th
-                data-testid={`${testid}-header-${header.column.id}`}
-                // Stryker disable next-line StringLiteral : React key property not exposed in dom
-                key={`${testid}-header-${header.column.id}`}
-                colSpan={header.colSpan}
-              >
-                {header.isPlaceholder ? null : (
-                  <div
-                    // Add onClick handler for sorting if the column is sortable
-                    {...(header.column.getCanSort() && {
-                      onClick: header.column.getToggleSortingHandler(),
-                      style: { cursor: "pointer" }, // Add cursor style for visual cue
-                    })}
-                    data-testid={`${testid}-header-${header.column.id}-sort-header`}
-                  >
-                    {flexRender(
-                      header.column.columnDef.header,
-                      header.getContext(),
-                    )}
-                    <SortCaret header={header} testId={testid} />
-                  </div>
-                )}
-              </th>
-            ))}
+            {headerGroup.headers.map(() => undefined)}
           </tr>
         ))}
killedBy: OurTable tests renders a table with three rows with correct test ids
statusReason: Unable to find an element by: [data-testid="testid-header-col1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="testid"

[Killed] StringLiteral
src/main/components/OurTable.jsx:46:40
                     // Add onClick handler for sorting if the column is sortable
                     {...(header.column.getCanSort() && {
                       onClick: header.column.getToggleSortingHandler(),
-                      style: { cursor: "pointer" }, // Add cursor style for visual cue
+                      style: { cursor: "" }, // Add cursor style for visual cue
                     })}
                     data-testid={`${testid}-header-${header.column.id}-sort-header`}
killedBy: OurTable tests click on a header and a sort caret should appear
statusReason: expect(element).toHaveStyle()

- Expected

- cursor: pointer;

[Killed] StringLiteral
src/main/components/OurTable.jsx:48:34
                       onClick: header.column.getToggleSortingHandler(),
                       style: { cursor: "pointer" }, // Add cursor style for visual cue
                     })}
-                    data-testid={`${testid}-header-${header.column.id}-sort-header`}
+                    data-testid={``}
                   >
                     {flexRender(
killedBy: OurTable tests click on a header and a sort caret should appear
statusReason: Unable to find an element by: [data-testid="sampleTestId-header-col1-sort-header"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="sampleTestId"

[Killed] StringLiteral
src/main/components/OurTable.jsx:64:29
       </thead>
       <tbody>
         {table.getRowModel().rows.map((row) => {
-          const rowTestId = `${testid}-row-${row.index}`;
+          const rowTestId = ``;
           return (
             <tr
killedBy: OurTable tests renders a table with three rows with correct test ids
statusReason: Unable to find an element by: [data-testid="testid-row-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="testid"

[Killed] StringLiteral
src/main/components/OurTable.jsx:72:32
               key={rowTestId}
             >
               {row.getVisibleCells().map((cell) => {
-                const testId = `${testid}-cell-row-${cell.row.index}-col-${cell.column.id}`;
+                const testId = ``;
                 return (
                   <td
killedBy: OurTable tests click on a header and a sort caret should appear
statusReason: Unable to find an element by: [data-testid="sampleTestId-cell-row-0-col-col1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="sampleTestId"

[Killed] ObjectLiteral
src/main/components/OurTable.jsx:96:45
 export function ButtonColumn(label, variant, callback, testid) {
   const columnHelper = createColumnHelper();
 
-  const buttonColumn = columnHelper.display({
-    id: label, // Unique ID for display columns
-    header: label,
-    cell: ({ cell }) => (
-      <Button
-        variant={variant}
-        onClick={() => callback(cell)}
-        data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
-      >
-        {label}
-      </Button>
-    ),
-  });
+  const buttonColumn = columnHelper.display({});
   return buttonColumn;
 }
killedBy: OurTable tests renders an empty table without crashing
statusReason: Columns require an id when using a non-string header
