[Killed] LogicalOperator
main/components/DokkuScripts/DokkuScriptForm.jsx:39:35
                     data-testid={`${testId}-appname`}
                     type="text"
                     isInvalid={Boolean(errors.appname)}
-                    defaultValue={params.appname || ""}
+                    defaultValue={params.appname && ""}
                     {...register("appname", {
                       required: "appname is required.",
killedBy: HomePage tests uses values from local storage when set
statusReason: expect(element).toHaveValue(foobar)

Expected the element to have value:
  foobar
Received:

[Killed] ConditionalExpression
main/components/DokkuScripts/DokkuScriptForm.jsx:69:35
                     data-testid={`${testId}-email`}
                     type="email"
                     isInvalid={Boolean(errors.email)}
-                    defaultValue={params.email || ""}
+                    defaultValue={true}
                     {...register("email", {
                       required: "email is required.",
killedBy: DokkuScript tests when form is submitted
statusReason: expected "spy" to be called with arguments: [ { appname: 'team01', …(7) } ]

Received: 

  1st spy call:

@@ -1,9 +1,9 @@
  [

[Killed] ObjectLiteral
main/components/DokkuScripts/DokkuScriptForm.jsx:70:43
                     type="email"
                     isInvalid={Boolean(errors.email)}
                     defaultValue={params.email || ""}
-                    {...register("email", {
-                      required: "email is required.",
-                    })}
+                    {...register("email", {})}
                   />
                   <Form.Control.Feedback type="invalid">
killedBy: DokkuScript tests when form is submitted without filling in required fields
statusReason: Unable to find an element with the text: /email is required/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="py-5 DokkuScriptForm container"
      data-testid="DokkuScriptForm"

[Killed] StringLiteral
main/components/DokkuScripts/DokkuScriptForm.jsx:71:33
                     isInvalid={Boolean(errors.email)}
                     defaultValue={params.email || ""}
                     {...register("email", {
-                      required: "email is required.",
+                      required: "",
                     })}
                   />
killedBy: DokkuScript tests when form is submitted without filling in required fields
statusReason: Unable to find an element with the text: /email is required/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="py-5 DokkuScriptForm container"
      data-testid="DokkuScriptForm"

[Killed] ConditionalExpression
main/components/DokkuScripts/DokkuScriptForm.jsx:99:35
                     data-testid={`${testId}-org`}
                     type="text"
                     isInvalid={Boolean(errors.org)}
-                    defaultValue={params.org || ""}
+                    defaultValue={true}
                     {...register("org", {
                       required: "org is required.",
killedBy: HomePage tests uses values from local storage when set
statusReason: expected "spy" to be called with arguments: [ 'HomePage.params', …(1) ]

Received: 

  1st spy call:

  [
    "HomePage.params",

[Killed] StringLiteral
main/components/DokkuScripts/DokkuScriptForm.jsx:100:34
                     type="text"
                     isInvalid={Boolean(errors.org)}
                     defaultValue={params.org || ""}
-                    {...register("org", {
+                    {...register("", {
                       required: "org is required.",
                     })}
killedBy: HomePage tests renders without crashing
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/DokkuScripts/DokkuScriptForm.jsx:111:34
                 <Col sm={4}>
                   <Form.Text
                     className="text-muted"
-                    data-testid={`${testId}-org-help`}
+                    data-testid={``}
                   >
                     The name of your Github organization, e.g.{" "}
killedBy: DokkuScript tests has expected help content
statusReason: Unable to find an element by: [data-testid="DokkuScriptForm-org-help"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="py-5 DokkuScriptForm container"
      data-testid="DokkuScriptForm"

[Killed] StringLiteral
main/components/DokkuScripts/DokkuScriptForm.jsx:125:34
                 </Form.Label>
                 <Col sm={6}>
                   <Form.Control
-                    data-testid={`${testId}-repo`}
+                    data-testid={``}
                     type="text"
                     isInvalid={Boolean(errors.repo)}
killedBy: DokkuScript tests when form is submitted
statusReason: Unable to find an element by: [data-testid="DokkuScriptForm-repo"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="py-5 DokkuScriptForm container"
      data-testid="DokkuScriptForm"

[Killed] ObjectLiteral
main/components/DokkuScripts/DokkuScriptForm.jsx:129:42
                     type="text"
                     isInvalid={Boolean(errors.repo)}
                     defaultValue={params.repo || ""}
-                    {...register("repo", {
-                      required: "repo is required.",
-                    })}
+                    {...register("repo", {})}
                   />
                   <Form.Control.Feedback type="invalid">
killedBy: DokkuScript tests when form is submitted without filling in required fields
statusReason: Unable to find an element with the text: /repo is required/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="py-5 DokkuScriptForm container"
      data-testid="DokkuScriptForm"

[Killed] StringLiteral
main/components/DokkuScripts/DokkuScriptForm.jsx:142:76
                     className="text-muted"
                     data-testid={`${testId}-repo-help`}
                   >
-                    The name of your repository, e.g. <code>team01</code>,{" "}
+                    The name of your repository, e.g. <code>team01</code>,{""}
                     <code>proj-courses-s26-03</code>.
                   </Form.Text>
killedBy: DokkuScript tests has expected help content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  The name of your repository, e.g. team01, proj-courses-s26-03.
Received:
  The name of your repository, e.g. team01,proj-courses-s26-03.

[Killed] ConditionalExpression
main/components/DokkuScripts/DokkuScriptForm.jsx:161:35
                     data-testid={`${testId}-google_client_id`}
                     type="text"
                     isInvalid={Boolean(errors.google_client_id)}
-                    defaultValue={params.google_client_id || ""}
+                    defaultValue={false}
                     {...register("google_client_id", {
                       required: "Google Client ID is required.",
killedBy: DokkuScript tests when form is submitted
statusReason: expected "spy" to be called with arguments: [ { appname: 'team01', …(7) } ]

Received: 

  1st spy call:

@@ -1,10 +1,10 @@
  [

[Killed] StringLiteral
main/components/DokkuScripts/DokkuScriptForm.jsx:162:34
                     type="text"
                     isInvalid={Boolean(errors.google_client_id)}
                     defaultValue={params.google_client_id || ""}
-                    {...register("google_client_id", {
+                    {...register("", {
                       required: "Google Client ID is required.",
                     })}
killedBy: DokkuScript tests has expected attributes
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] ConditionalExpression
main/components/DokkuScripts/DokkuScriptForm.jsx:194:35
                     data-testid={`${testId}-google_client_secret`}
                     type="text"
                     isInvalid={Boolean(errors.google_client_secret)}
-                    defaultValue={params.google_client_secret || ""}
+                    defaultValue={true}
                     {...register("google_client_secret", {
                       required: "Google Client Secret is required.",
killedBy: DokkuScript tests when form is submitted
statusReason: expected "spy" to be called with arguments: [ { appname: 'team01', …(7) } ]

Received: 

  1st spy call:

@@ -1,11 +1,11 @@
  [

[Killed] StringLiteral
main/components/DokkuScripts/DokkuScriptForm.jsx:221:34
                 <Col sm={6}>
                   <Form.Check
                     type="checkbox"
-                    data-testid={`${testId}-mongo`}
+                    data-testid={``}
                     defaultChecked={params.mongo || false}
                     {...register("mongo")}
killedBy: DokkuScript tests when form is submitted with mongo checkbox checked
statusReason: Unable to find an element by: [data-testid="DokkuScriptForm-mongo"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="py-5 DokkuScriptForm container"
      data-testid="DokkuScriptForm"

[Killed] LogicalOperator
main/components/DokkuScripts/DokkuScriptForm.jsx:222:37
                   <Form.Check
                     type="checkbox"
                     data-testid={`${testId}-mongo`}
-                    defaultChecked={params.mongo || false}
+                    defaultChecked={params.mongo && false}
                     {...register("mongo")}
                   />
killedBy: HomePage tests uses values from local storage when set
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  class="form-check-input"
  data-testid="DokkuScriptForm-mongo"
  id="mongo"
  name="mongo"

[Killed] ConditionalExpression
main/components/DokkuScripts/DokkuScriptForm.jsx:222:37
                   <Form.Check
                     type="checkbox"
                     data-testid={`${testId}-mongo`}
-                    defaultChecked={params.mongo || false}
+                    defaultChecked={false}
                     {...register("mongo")}
                   />
killedBy: HomePage tests uses values from local storage when set
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  class="form-check-input"
  data-testid="DokkuScriptForm-mongo"
  id="mongo"
  name="mongo"

[Killed] ConditionalExpression
main/components/DokkuScripts/DokkuScriptForm.jsx:244:37
                   <Form.Check
                     type="checkbox"
                     data-testid={`${testId}-ucsb_api`}
-                    defaultChecked={params.ucsb_api || false}
+                    defaultChecked={true}
                     {...register("ucsb_api")}
                   />
killedBy: DokkuScript tests when form is submitted
statusReason: expected "spy" to be called with arguments: [ { appname: 'team01', …(7) } ]

Number of calls: 0

[Killed] ConditionalExpression
main/components/DokkuScripts/DokkuScriptForm.jsx:244:37
                   <Form.Check
                     type="checkbox"
                     data-testid={`${testId}-ucsb_api`}
-                    defaultChecked={params.ucsb_api || false}
+                    defaultChecked={false}
                     {...register("ucsb_api")}
                   />
killedBy: DokkuScript tests renders with initial ucsb_api params set to true
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  class="form-check-input"
  data-testid="DokkuScriptForm-ucsb_api"
  id="ucsb_api"
  name="ucsb_api"

[Killed] ConditionalExpression
main/components/DokkuScripts/DokkuScriptForm.jsx:268:37
                       data-testid={`${testId}-ucsb_api_key`}
                       type="text"
                       isInvalid={Boolean(errors.ucsb_api_key)}
-                      defaultValue={params.ucsb_api_key || ""}
+                      defaultValue={false}
                       {...register("ucsb_api_key", {
                         required: "UCSB API Key is required.",
killedBy: DokkuScript tests when form is submitted with ucsb_api checkbox checked
statusReason: expected "spy" to be called with arguments: [ { appname: 'team01', …(8) } ]

Received: 

  1st spy call:

@@ -6,8 +6,8 @@
      "google_client_secret": "sample-client-secret",

[Killed] ConditionalExpression
main/components/DokkuScripts/DokkuScriptForm.jsx:268:37
                       data-testid={`${testId}-ucsb_api_key`}
                       type="text"
                       isInvalid={Boolean(errors.ucsb_api_key)}
-                      defaultValue={params.ucsb_api_key || ""}
+                      defaultValue={true}
                       {...register("ucsb_api_key", {
                         required: "UCSB API Key is required.",
killedBy: HomePage tests uses values from local storage when set
statusReason: expect(element).toHaveValue(ucsb_key)

Expected the element to have value:
  ucsb_key
Received:
  true

[Killed] OptionalChaining
main/components/DokkuScripts/DokkuScriptForm.jsx:274:24
                       })}
                     />
                     <Form.Control.Feedback type="invalid">
-                      {errors.ucsb_api_key?.message}
+                      {errors.ucsb_api_key.message}
                     </Form.Control.Feedback>
                   </Col>
killedBy: HomePage tests uses values from local storage when set
statusReason: Cannot read properties of undefined (reading 'message')
