[Killed] BooleanLiteral
main/components/DokkuScripts/DokkuScriptGenerate.jsx:11:14
   google_client_id = "get-value-from-google",
   google_client_secret = "get-value-from-google",
   mongo = false,
-  ucsb_api = false,
+  ucsb_api = true,
   ucsb_api_key = "get-value-from-ucsb-api",
 }) {
killedBy: DokkuScript tests defaults
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:

  dokku apps:create happycows
  dokku git:set happycows keep-git-dir true
  dokku config:set --no-restart happycows PRODUCTION=true
  dokku config:set --no-restart happycows SOURCE_REPO=https://github.com/ucsb-cs156/proj-happycows

[Killed] StringLiteral
main/components/DokkuScripts/DokkuScriptGenerate.jsx:12:18
   google_client_secret = "get-value-from-google",
   mongo = false,
   ucsb_api = false,
-  ucsb_api_key = "get-value-from-ucsb-api",
+  ucsb_api_key = "",
 }) {
   const configSet = (key, value) =>
killedBy: DokkuScript tests includes default ucsb_api_key when ucsb_api is true and ucsb_api_key is omitted
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:

  dokku apps:create happycows
  dokku git:set happycows keep-git-dir true
  dokku config:set --no-restart happycows PRODUCTION=true
  dokku config:set --no-restart happycows SOURCE_REPO=https://github.com/ucsb-cs156/proj-happycows

[Killed] ArrowFunction
main/components/DokkuScripts/DokkuScriptGenerate.jsx:14:21
   ucsb_api = false,
   ucsb_api_key = "get-value-from-ucsb-api",
 }) {
-  const configSet = (key, value) =>
-    `dokku config:set --no-restart ${appname} ${key}=${value}`;
+  const configSet = () => undefined;
 
   const mongoInstructions = mongo
killedBy: DokkuScript tests defaults
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:

  dokku apps:create happycows
  dokku git:set happycows keep-git-dir true
  dokku config:set --no-restart happycows PRODUCTION=true
  dokku config:set --no-restart happycows SOURCE_REPO=https://github.com/ucsb-cs156/proj-happycows

[Killed] StringLiteral
main/components/DokkuScripts/DokkuScriptGenerate.jsx:21:7
     ? `
       dokku mongo:create ${appname}-m
       dokku mongo:link ${appname}-m ${appname}`
-    : "";
+    : "Stryker was here!";
 
   const ucsbApiInstructions = ucsb_api
killedBy: DokkuScript tests defaults
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:

  dokku apps:create happycows
  dokku git:set happycows keep-git-dir true
  dokku config:set --no-restart happycows PRODUCTION=true
  dokku config:set --no-restart happycows SOURCE_REPO=https://github.com/ucsb-cs156/proj-happycows

[Killed] StringLiteral
main/components/DokkuScripts/DokkuScriptGenerate.jsx:24:7
     : "";
 
   const ucsbApiInstructions = ucsb_api
-    ? `
-      ${configSet("UCSB_API_KEY", ucsb_api_key)}`
+    ? ``
     : "";
 
killedBy: DokkuScript tests includes ucsb_api instructions when ucsb_api is true
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:

  dokku apps:create happycows
  dokku git:set happycows keep-git-dir true
  dokku config:set --no-restart happycows PRODUCTION=true
  dokku config:set --no-restart happycows SOURCE_REPO=https://github.com/ucsb-cs156/proj-happycows

[Killed] StringLiteral
main/components/DokkuScripts/DokkuScriptGenerate.jsx:25:19
 
   const ucsbApiInstructions = ucsb_api
     ? `
-      ${configSet("UCSB_API_KEY", ucsb_api_key)}`
+      ${configSet("", ucsb_api_key)}`
     : "";
 
killedBy: DokkuScript tests includes ucsb_api instructions when ucsb_api is true
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:

  dokku apps:create happycows
  dokku git:set happycows keep-git-dir true
  dokku config:set --no-restart happycows PRODUCTION=true
  dokku config:set --no-restart happycows SOURCE_REPO=https://github.com/ucsb-cs156/proj-happycows

[Killed] StringLiteral
main/components/DokkuScripts/DokkuScriptGenerate.jsx:31:33
   const content = `
       dokku apps:create ${appname}
       dokku git:set ${appname} keep-git-dir true
-      ${configSet("PRODUCTION", "true")}
+      ${configSet("PRODUCTION", "")}
       ${configSet("SOURCE_REPO", `https://github.com/${org}/${repo}`)}
       ${configSet("GOOGLE_CLIENT_ID", google_client_id)}
killedBy: DokkuScript tests defaults
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:

  dokku apps:create happycows
  dokku git:set happycows keep-git-dir true
  dokku config:set --no-restart happycows PRODUCTION=true
  dokku config:set --no-restart happycows SOURCE_REPO=https://github.com/ucsb-cs156/proj-happycows

[Killed] StringLiteral
main/components/DokkuScripts/DokkuScriptGenerate.jsx:32:19
       dokku apps:create ${appname}
       dokku git:set ${appname} keep-git-dir true
       ${configSet("PRODUCTION", "true")}
-      ${configSet("SOURCE_REPO", `https://github.com/${org}/${repo}`)}
+      ${configSet("", `https://github.com/${org}/${repo}`)}
       ${configSet("GOOGLE_CLIENT_ID", google_client_id)}
       ${configSet("GOOGLE_CLIENT_SECRET", google_client_secret)}${ucsbApiInstructions}
killedBy: DokkuScript tests defaults
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:

  dokku apps:create happycows
  dokku git:set happycows keep-git-dir true
  dokku config:set --no-restart happycows PRODUCTION=true
  dokku config:set --no-restart happycows SOURCE_REPO=https://github.com/ucsb-cs156/proj-happycows

[Killed] StringLiteral
main/components/DokkuScripts/DokkuScriptGenerate.jsx:45:31
 `;
 
   return (
-    <pre style={{ whiteSpace: "pre" }} data-testid="dokkuscript">
+    <pre style={{ whiteSpace: "" }} data-testid="dokkuscript">
       {content}
     </pre>
killedBy: DokkuScript tests has expected attributes
statusReason: expect(element).toHaveAttribute("style", "white-space: pre;") // element.getAttribute("style") === "white-space: pre;"

Expected the element to have attribute:
  style="white-space: pre;"
Received:
  null
