[Killed] BlockStatement
main/layouts/BasicLayout/BasicLayout.jsx:5:51
 import Footer from "main/components/Nav/Footer";
 import AppNavbar from "main/components/Nav/AppNavbar";
 
-export default function BasicLayout({ children }) {
-  return (
-    <div className="d-flex flex-column min-vh-100">
-      <AppNavbar />
-      <Container expand="xl" className="pt-4 flex-grow-1">
-        {children}
-      </Container>
-      <Footer />
-    </div>
-  );
-}
+export default function BasicLayout({ children }) {}
 
killedBy: HomePage tests renders without crashing
statusReason: Unable to find role="heading" and name `/Dokku Config/i`

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
